#+TITLE: Dot-Emacs Configuration
#+AUTHOR: Victor Vialard
#+STARTUP: fold

#+begin_src elisp
(mapc 'load (file-expand-wildcards "~/.doom.d/modules/*.el"))
(use-package exec-path-from-shell
  :ensure t
  :config
  (when (memq window-system '(mac ns x))
    (exec-path-from-shell-initialize)))
#+end_src

** Org-Pomodoro

#+begin_src elisp
(use-package org-pomodoro
  :after org
  :ensure t
  :commands (org-pomodoro)
  :config
  (setq
   org-pomodoro-length 25
   org-pomodoro-short-break-length 5
   org-pomodoro-long-break-length 20
   org-pomodoro-play-sounds nil))

(defun my/emacs-query-pomodoro ()
  "Return the remaining pomodoro time"
  (if (org-pomodoro-active-p)
      (cl-case org-pomodoro-state
        (:pomodoro
         (format "Pomo: %d min \n---\n%s" (/ (org-pomodoro-remaining-seconds) 60) org-clock-heading))
        (:short-break
         (format "Break: %d min" (/ (org-pomodoro-remaining-seconds) 60)))
        (:long-break
         (format "Break: %d min" (/ (org-pomodoro-remaining-seconds) 60)))
        (:overtime
         (format "Over! %d min" (/ (org-pomodoro-remaining-seconds) 60))))
    "No pomo"))
#+end_src

#+begin_src elisp
;; Needs terminal-notifier (brew install terminal-notifier)
(defun notify-osx (title msg)
  (let ((notifier-path (executable-find "terminal-notifier")))
       (start-process
           "OSX Alert"
           "*OSX Alert*" ; use `nil` to not capture output; this captures output in background
           notifier-path
           "-message" msg
           "-title" title
           "-sender" "com.apple.automator.EmacsClient")))

;; org-pomodoro mode hooks
(add-hook 'org-pomodoro-finished-hook
          (lambda ()
          (notify-osx "Pomodoro completed!" "Time for a break.")))

(add-hook 'org-pomodoro-break-finished-hook
          (lambda ()
          (notify-osx "Pomodoro Short Break Finished" "Ready for Another?")))

(add-hook 'org-pomodoro-long-break-finished-hook
          (lambda ()
            (notify-osx "Pomodoro Long Break Finished" "Ready for Another?")))

(add-hook 'org-pomodoro-killed-hook
          (lambda ()
          (notify-osx "Pomodoro Killed" "One does not simply kill a pomodoro!")))
#+end_src

#+RESULTS:
| lambda | nil | (notify-osx Pomodoro Killed One does not simply kill a pomodoro!) |

